"""
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
*Пример:*
5
    1 2 3 4 5
    3
    -> 1 """

import random

n = int(input('Введите количество элементов в массиве '))
print (n)
list_t = []
x = int(input('Введите искомый элемент '))
y = 0

for i in range(n):
    list_t.append(random.randint(0,9))
    if (list_t[i] == x):
        y += 1

print(*list_t)
print (x)
print("->", y)